# Assignment 5

In [20]:
import pandas as pd 
import time

## Task 01

In [21]:
df1=pd.read_csv("sales.csv")   #Reading sales csv
df2=pd.read_csv("customers.csv") #Reading customers csv

In [22]:
df1.shape #Dimensions of sales.csv

(400, 4)

In [23]:
df2.shape #Dimensions of customers.csv

(100, 3)

In [24]:
df1.head()   #Show first 5 rows of sales

   SaleID  CustomerID     Product  Amount
0     101           1      Laptop     200
1     102           2  Smartphone     500
2     103           3      Tablet     800
3     104           4  Headphones    1100
4     105           5     Monitor    1400

In [25]:
df2.head()    #Shows first 5 rows of customers

   CustomerID  Age         City
0           1   22     New York
1           2   23  Los Angeles
2           3   24      Chicago
3           4   25      Houston
4           5   26      Phoenix

## Task 02

In [26]:
customers = df2.to_dict(orient='records')   #COnverting DF to Dictionary (Each record is a seprate dictionary)
print(customers[:5])

[{'CustomerID': 1, 'Age': 22, 'City': 'New York'}, {'CustomerID': 2, 'Age': 23, 'City': 'Los Angeles'}, {'CustomerID': 3, 'Age': 24, 'City': 'Chicago'}, {'CustomerID': 4, 'Age': 25, 'City': 'Houston'}, {'CustomerID': 5, 'Age': 26, 'City': 'Phoenix'}]

In [27]:
#FIlter the count of customers in Houston in dictionary
city = "Houston"
start_time = time.time()
filtered = []
for customer in customers:
    if customer['City'] == city:
        filtered.append(customer)
dict_time = time.time() - start_time

print(f"Number of customers from {city}: {len(filtered)}")
print(f"Time using dictionary: {dict_time:.6f} seconds")

Number of customers from Houston: 20
Time using dictionary: 0.001002 seconds

In [28]:
#FIlter the count of customers in Houston in DataFrame
start_time = time.time()
filtered_df = df2[df2['City'] == city]
df_time = time.time() - start_time
print(f"Filtered customers (DataFrame): {len(filtered_df)}")
print(f"Time using DataFrame: {df_time:.6f} seconds")

Filtered customers (DataFrame): 20
Time using DataFrame: 0.004999 seconds

## Task 03

In [48]:
#To check if there are any duplicate rows 
duplicates = df1.duplicated()
print(f"Number of duplicate rows: {duplicates.sum()}")
duplicates2 = df2.duplicated()
print(f"Number of duplicate rows: {duplicates.sum()}")

Number of duplicate rows: 0
Number of duplicate rows: 0

## Task 04

In [50]:
#Add a column with 10% discount on amount 
print(df1.head())
df1['Discounted_Amount'] = (df1["Amount"] * 0.9)  
print("\nData with Discounted Amount:")
print(df1.head())

   SaleID  CustomerID     Product  Amount  Discounted_Amount
0     101           1      Laptop     200              180.0
1     102           2  Smartphone     500              450.0
2     103           3      Tablet     800              720.0
3     104           4  Headphones    1100              990.0
4     105           5     Monitor    1400             1260.0

Data with Discounted Amount:
   SaleID  CustomerID     Product  Amount  Discounted_Amount
0     101           1      Laptop     200              180.0
1     102           2  Smartphone     500              450.0
2     103           3      Tablet     800              720.0
3     104           4  Headphones    1100              990.0
4     105           5     Monitor    1400             1260.0

In [51]:
#Grouping Products and sum the discounted price that is calculated in last task
grouped_sales = df1.groupby('Product')['Discounted_Amount'].sum().reset_index()
grouped_sales.rename(columns={'Discounted_Amount': 'Total_Sales'}, inplace=True)
print("\nTotal Sales by Product:")
print(grouped_sales)

Total Sales by Product:
      Product  Total_Sales
0  Headphones      79200.0
1      Laptop      14400.0
2     Monitor     100800.0
3  Smartphone      36000.0
4      Tablet      57600.0

## Task 5

In [53]:
#Filter people of specific age group (25 to 35)
filt = df2[(df2['Age'] >= 25) & (df2['Age'] <= 35)]
print("\nFiltered Customers (Age 25-35):")
print(filt)

Filtered Customers (Age 25-35):
    CustomerID  Age         City
3            4   25      Houston
4            5   26      Phoenix
5            6   27     New York
6            7   28  Los Angeles
7            8   29      Chicago
8            9   30      Houston
9           10   31      Phoenix
10          11   32     New York
11          12   33  Los Angeles
12          13   34      Chicago
13          14   35      Houston
33          34   25      Houston
34          35   26      Phoenix
35          36   27     New York
36          37   28  Los Angeles
37          38   29      Chicago
38          39   30      Houston
39          40   31      Phoenix
40          41   32     New York
41          42   33  Los Angeles
42          43   34      Chicago
43          44   35      Houston
63          64   25      Houston
64          65   26      Phoenix
65          66   27     New York
66          67   28  Los Angeles
67          68   29      Chicago
68          69   30      Houston
69          70   31      Phoenix
70          71   32     New York
71          72   33  Los Angeles
72          73   34      Chicago
73          74   35      Houston
93          94   25      Houston
94          95   26      Phoenix
95          96   27     New York
96          97   28  Los Angeles
97          98   29      Chicago
98          99   30      Houston
99         100   31      Phoenix

In [54]:
#Counting specifcally filtered people from each city
city = filt['City'].value_counts().reset_index()
city.columns = ['City', 'Customer_Count']

print("\nCity-wise Customer Count:")
print(city)

City-wise Customer Count:
          City  Customer_Count
0      Houston              11
1      Phoenix               8
2     New York               7
3  Los Angeles               7
4      Chicago               7

## Task 06

In [56]:
#Merging the sales and customers dataframes in new dataframe on CustomerID
df3 = pd.merge(df1, df2, on='CustomerID', how='inner')
df3.head()

   SaleID  CustomerID     Product  Amount  Discounted_Amount  Age         City
0     101           1      Laptop     200              180.0   22     New York
1     102           2  Smartphone     500              450.0   23  Los Angeles
2     103           3      Tablet     800              720.0   24      Chicago
3     104           4  Headphones    1100              990.0   25      Houston
4     105           5     Monitor    1400             1260.0   26      Phoenix

In [57]:
#Finding the city with the highest sales
city_sales = df3.groupby('City')['Amount'].sum().reset_index()
sales = city_sales.sort_values(by='Amount', ascending=False)

highest_sales_city = city_sales.iloc[0]
print("\nCity with the highest total sales:")
print(highest_sales_city)

City with the highest total sales:
City      Chicago
Amount      64000
Name: 0, dtype: object

In [58]:
#Finding the most sold product 
product_sales = df3.groupby('Product')['Amount'].sum().reset_index()
product_sales = product_sales.sort_values(by='Amount', ascending=False)
most_sold = product_sales.iloc[0]
print("\nProduct with the most total sales:")
print(most_sold)

Product with the most total sales:
Product    Monitor
Amount      112000
Name: 2, dtype: object

## Task 07

In [59]:
#Finding the unique cities,products,mean amount , median amount
print("Unique Cities:")
print(df3['City'].unique())
print("\nUnique Products:")
print(df3['Product'].unique())
mean_amount = df3['Amount'].mean()
median_amount = df3['Amount'].median()
print("\nMean of Amount:", mean_amount)
print("Median of Amount:", median_amount)

Unique Cities:
['New York' 'Los Angeles' 'Chicago' 'Houston' 'Phoenix']

Unique Products:
['Laptop' 'Smartphone' 'Tablet' 'Headphones' 'Monitor']

Mean of Amount: 800.0
Median of Amount: 800.0